## Scratch: load_balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.firehose_waf_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "firehose_waf_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "iam:CreateServiceLinkedRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging",
            ]
        }
    }

  # aws_acm_certificate.form_viewer will be created
  + resource "aws_acm_certificate" "form_viewer" {
      + arn                       = (known after apply)
      + domain_name               = "forms-scratch.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "forms-scratch.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_iam_role.firehose_waf_logs will be created
  + resource "aws_iam_role" "firehose_waf_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "firehose_waf_logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.firehose_waf_logs will be created
  + resource "aws_iam_role_policy" "firehose_waf_logs" {
      + id     = (known after apply)
      + name   = "firehose-waf-logs-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs" {
      + arn            = (known after apply)
      + destination    = "s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-forms"
      + tags           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + s3_configuration {
          + bucket_arn         = (known after apply)
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "UNCOMPRESSED"
          + role_arn           = (known after apply)

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_lb.form_viewer will be created
  + resource "aws_lb" "form_viewer" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = true
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "form-viewer"
      + security_groups            = [
          + "sg-0e3d274cb6aae5a67",
        ]
      + subnets                    = [
          + "subnet-09e3ddf7091162c43",
          + "subnet-0c1f154544e11d335",
          + "subnet-0f66e142ef8b72ad5",
        ]
      + tags                       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "form_viewer"
          + "Terraform"  = "true"
        }
      + tags_all                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "form_viewer"
          + "Terraform"  = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.form_viewer_http will be created
  + resource "aws_lb_listener" "form_viewer_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.form_viewer_https will be created
  + resource "aws_lb_listener" "form_viewer_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2019-08"
      + tags              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.form_viewer_1 will be created
  + resource "aws_lb_target_group" "form_viewer_1" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "form-viewer"
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "form_viewer_1"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "form_viewer_1"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-06f222063dbe155b5"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = "301,200"
          + path                = "/api/version"
          + port                = "3000"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group.form_viewer_2 will be created
  + resource "aws_lb_target_group" "form_viewer_2" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "form-viewer-2"
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "form_viewer_2"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "form_viewer_2"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-06f222063dbe155b5"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = "301,200"
          + path                = "/api/version"
          + port                = "3000"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_route53_record.form_viewer will be created
  + resource "aws_route53_record" "form_viewer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "forms-scratch.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z02948692OGMOB8MHPBFU"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-scratch.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "form_viewer_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z02948692OGMOB8MHPBFU"
    }

  # aws_s3_bucket.firehose_waf_logs will be created
  + resource "aws_s3_bucket" "firehose_waf_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-scratch-terraform-waf-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 90
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.firehose_waf_logs will be created
  + resource "aws_s3_bucket_public_access_block" "firehose_waf_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_wafv2_web_acl.forms_acl will be created
  + resource "aws_wafv2_web_acl" "forms_acl" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "GCForms"
      + scope      = "REGIONAL"
      + tags       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "PostRequestLimit"
          + priority = 102

          + action {

              + count {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 100

                  + scope_down_statement {

                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "post"

                          + field_to_match {

                              + method {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "PostRequestRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"

                  + excluded_rule {
                      + name = "GenericRFI_QUERYARGUMENTS"
                    }
                  + excluded_rule {
                      + name = "GenericRFI_BODY"
                    }
                  + excluded_rule {
                      + name = "SizeRestrictions_BODY"
                    }
                  + excluded_rule {
                      + name = "CrossSiteScripting_BODY"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 3

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 4

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "forms_global_rule"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl_association.form_viewer_assocation will be created
  + resource "aws_wafv2_web_acl_association" "form_viewer_assocation" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_forms will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_forms" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_https_listener_arn  = (known after apply)
  + lb_target_group_1_arn  = (known after apply)
  + lb_target_group_1_name = "form-viewer"
  + lb_target_group_2_name = "form-viewer-2"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
